src/conf/xml-resources/web-service-references/AuthorizationService/wsdl/localhost_8080/AuthorizationServiceService/AuthorizationService.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Metro/2.3 (tags/2.3-7528; 2013-04-29T19:34:10+0000) JAXWS-RI/2.2.8 JAXWS/2.2 svn-revision#unknown. --><definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/AuthorizationService/java/AuthorizationService" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" name="AuthorizationService" targetNamespace="http://j2ee.netbeans.org/wsdl/AuthorizationService/java/AuthorizationService">
    <types/>
    <message name="AuthorizationServiceOperationRequest">
        <part name="username" type="xsd:string"/>
        <part name="password" type="xsd:string"/>
    </message>
    <message name="AuthorizationServiceOperationResponse">
        <part name="return" type="xsd:boolean"/>
    </message>
    <portType name="AuthorizationServicePortType">
        <operation name="AuthorizationServiceOperation">
            <input name="input1" message="tns:AuthorizationServiceOperationRequest"/>
            <output name="output1" message="tns:AuthorizationServiceOperationResponse"/>
        </operation>
    </portType>
    <binding name="AuthorizationServiceBinding" type="tns:AuthorizationServicePortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="AuthorizationServiceOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/AuthorizationService/java/AuthorizationService"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/AuthorizationService/java/AuthorizationService"/>
            </output>
        </operation>
    </binding>
    <service name="AuthorizationServiceService">
        <port name="AuthorizationServicePort" binding="tns:AuthorizationServiceBinding">
            <soap:address location="http://localhost:8080/AuthorizationServiceService/AuthorizationService"/>
        </port>
    </service>
    <plnk:partnerLinkType name="AuthorizationService">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="AuthorizationServicePortTypeRole" portType="tns:AuthorizationServicePortType"/>
    </plnk:partnerLinkType>
</definitions>